app/views/lists/index.html.erb

    <% @lists.each do |list| %>
      <% list.places.each do |place| %>
---
SELECT "places".* FROM "places" INNER JOIN "list_places" ON "places"."id" = "list_places"."place_id" WHERE "list_places"."list_id" = 3