app/controllers/lists_controller.rb

  def index
    if user_signed_in?
      @lists = List.where(user_id: current_user.id)
      @places = @lists.map {|list| list.places}
---
SELECT "lists".* FROM "lists" WHERE "lists"."user_id" = 2
SELECT "lists".* FROM "lists"
SELECT "places".* FROM "places" INNER JOIN "list_places" ON "places"."id" = "list_places"."place_id" WHERE "list_places"."list_id" = 3

  def create
    @list = List.new(params[:list])

    if user_signed_in?
      @list.user_id = current_user.id
    end

    respond_to do |format|
      if @list.save
---
INSERT INTO "lists" ("created_at", "name", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Sun, 26 Jan 2014 18:59:22 UTC +00:00], ["name", "Winebars"], ["updated_at", Sun, 26 Jan 2014 18:59:22 UTC +00:00], ["user_id", nil]]

  def update
    @list = List.find(params[:id])
---
SELECT "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT 1  [["id", "5"]]

  def destroy
    @list = List.find(params[:id])
    @list.destroy
---
SELECT "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "lists" WHERE "lists"."id" = ?  [["id", 2]]