app/controllers/places_controller.rb

  def show
    @place = Place.find(params[:id])
    @list = List.find(params[:list_id])
---
SELECT "places".* FROM "places" WHERE "places"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT 1  [["id", "3"]]

  def new
    @place = @list.places.build
    @list = List.find(params[:list_id])
---
SELECT "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT 1  [["id", "3"]]

  def edit
    @place = Place.find(params[:id])
---
SELECT "places".* FROM "places" WHERE "places"."id" = ? LIMIT 1  [["id", "16"]]

  def create
    @place = @list.places.new(params[:place].except(:photos))
    @list.save
---
INSERT INTO "list_places" ("created_at", "list_id", "place_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sun, 26 Jan 2014 19:33:10 UTC +00:00], ["list_id", 3], ["place_id", 2], ["updated_at", Sun, 26 Jan 2014 19:33:10 UTC +00:00]]
INSERT INTO "places" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Sun, 26 Jan 2014 19:00:22 UTC +00:00], ["name", "Boqueria"], ["updated_at", Sun, 26 Jan 2014 19:00:22 UTC +00:00]]

  def update
    @place = Place.find(params[:id])

    respond_to do |format|
      if @place.update_attributes(params[:place])
---
SELECT "places".* FROM "places" WHERE "places"."id" = ? LIMIT 1  [["id", "16"]]
UPDATE "places" SET "name" = 'test2asd', "updated_at" = '2014-01-26 21:53:44.900073' WHERE "places"."id" = 18

  def destroy
    @place = Place.find(params[:id])
    @place.destroy
---
SELECT "places".* FROM "places" WHERE "places"."id" = ? LIMIT 1  [["id", "16"]]
DELETE FROM "places" WHERE "places"."id" = ?  [["id", 16]]